// -----// IR Dump After AutoInputConversionPipelinePass (iree-auto-input-conversion) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After IREEImportPublicPass (iree-import-public) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    util.return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After ImportMLProgramPass (iree-import-ml-program) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    util.return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After SanitizeModuleNamesPass (iree-sanitize-module-names) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    util.return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After DemoteF64ToF32Pass (iree-input-conversion-demote-f64-to-f32) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    util.return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    util.return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = util.call @_matmul(%0, %1) : (tensor<4x4xf32>, tensor<4x4xf32>) -> tensor<4x4xf32>
    %3 = hal.tensor.export %2 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %3 : !hal.buffer_view
  }
  util.func private @_matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> attributes {hal.abi.convention = #hal.abi.convention<synchronous>} {
    %0 = tensor.empty() : tensor<4x4xf32>
    %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst = arith.constant 0.000000e+00 : f32
      %3 = arith.maximumf %in, %cst : f32
      linalg.yield %3 : f32
    } -> tensor<4x4xf32>
    util.return %2 : tensor<4x4xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func private @_matmul(%arg0: tensor<4x4xf32>, %arg1: tensor<4x4xf32>) -> tensor<4x4xf32> attributes {hal.abi.convention = #hal.abi.convention<synchronous>} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = tensor.empty() : tensor<4x4xf32>
  %1 = linalg.matmul ins(%arg0, %arg1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %2 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%1 : tensor<4x4xf32>) outs(%0 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %3 = arith.maximumf %in, %cst : f32
    linalg.yield %3 : f32
  } -> tensor<4x4xf32>
  util.return %2 : tensor<4x4xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = util.call @_matmul(%0, %1) : (tensor<4x4xf32>, tensor<4x4xf32>) -> tensor<4x4xf32>
  %3 = hal.tensor.export %2 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %3 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After AssignLegacyTargetDevicesPass (iree-hal-assign-legacy-target-devices) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {hal.device.targets = [#device_target_local]} {
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After MaterializeTargetDevicesPass (iree-hal-materialize-target-devices) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDevicePromisesPass (iree-hal-resolve-device-promises) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDeviceAliasesPass (iree-hal-resolve-device-aliases) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After VerifyDevicesPass (iree-hal-verify-devices) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After AttrBasedPipelinePass (iree-preprocessing-attr-based-pipeline) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

/Users/josephbak/scratch/matmul_relu.mlir:3:13: warning: reads uninitialized values from an operand produced by a tensor.empty op. To disable this warning, pass --iree-global-opt-enable-warn-on-uninitialized-values=false .
  %result = linalg.matmul ins(%a, %b : tensor<4x4xf32>, tensor<4x4xf32>)
            ^
/Users/josephbak/scratch/matmul_relu.mlir:1:1: note: called from
func.func @matmul(%a: tensor<4x4xf32>, %b: tensor<4x4xf32>) -> tensor<4x4xf32> {
^
/Users/josephbak/scratch/matmul_relu.mlir:3:13: note: see current operation: %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %result = linalg.matmul ins(%a, %b : tensor<4x4xf32>, tensor<4x4xf32>)
            ^
// -----// IR Dump After WarnOnUninitializedValuesPass (iree-global-opt-warn-on-uninitialized-values) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After OptimizeIntArithmeticPass (iree-util-optimize-int-arithmetic) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedConvToConvPass (iree-global-opt-quantized-conv-to-conv) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After LinalgQuantizedMatmulToMatmulPass (iree-global-opt-quantized-matmul-to-matmul) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After CanonicalizePass (iree-flow-canonicalize) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After RemoveZeroExtentTensorsPass (iree-global-opt-remove-zero-extent-tensors) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After DetachElementwiseFromNamedOpsPass (iree-global-opt-detach-elementwise-from-named-ops) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After SimplifyDepthwiseConvPass (simplify-depthwise-conv) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After EraseUnusedLinalgOperandsPass (iree-global-opt-erase-unused-linalg-operands) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapesPass (iree-global-opt-expand-tensor-shapes) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %2 = tensor.empty() : tensor<4x4xf32>
    %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.maximumf %in, %cst : f32
      linalg.yield %6 : f32
    } -> tensor<4x4xf32>
    %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %5 : !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalgPass (convert-elementwise-to-linalg) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After RaiseSpecialOpsPass (iree-global-opt-raise-special-ops) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After DecomposeConcatPass (iree-global-opt-decompose-concat) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After GeneralizeLinalgNamedOpsPass (iree-global-opt-generalize-linalg-named-ops) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %2 = tensor.empty() : tensor<4x4xf32>
  %3 = linalg.matmul ins(%0, %1 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3 : tensor<4x4xf32>) outs(%2 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %6 = arith.maximumf %in, %cst : f32
    linalg.yield %6 : f32
  } -> tensor<4x4xf32>
  %5 = hal.tensor.export %4 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %5 : !hal.buffer_view
}

// -----// IR Dump After InsertTensorBarriersPass (iree-dispatch-creation-insert-tensor-barriers) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = iree_tensor_ext.compute_barrier.start %0 : tensor<4x4xf32> -> tensor<4x4xf32>
  %2 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %3 = iree_tensor_ext.compute_barrier.start %2 : tensor<4x4xf32> -> tensor<4x4xf32>
  %4 = tensor.empty() : tensor<4x4xf32>
  %5 = linalg.matmul ins(%1, %3 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%5 : tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %9 = arith.maximumf %in, %cst : f32
    linalg.yield %9 : f32
  } -> tensor<4x4xf32>
  %7 = iree_tensor_ext.compute_barrier.end %6 : tensor<4x4xf32> -> tensor<4x4xf32>
  %8 = hal.tensor.export %7 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %8 : !hal.buffer_view
}

// -----// IR Dump After FoldUnitExtentDimsPass (iree-dispatch-creation-fold-unit-extent-dims) //----- //
#executable_target_embedded_elf_arm_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-arm_64", {cpu = "", cpu_features = "+reserve-x18", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128-Fn32", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "arm64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_arm_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
    %cst = arith.constant 0.000000e+00 : f32
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
    %1 = iree_tensor_ext.compute_barrier.start %0 : tensor<4x4xf32> -> tensor<4x4xf32>
    %2 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
    %3 = iree_tensor_ext.compute_barrier.start %2 : tensor<4x4xf32> -> tensor<4x4xf32>
    %4 = tensor.empty() : tensor<4x4xf32>
    %5 = linalg.matmul ins(%1, %3 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel"]} ins(%5 : tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %9 = arith.maximumf %in, %cst : f32
      linalg.yield %9 : f32
    } -> tensor<4x4xf32>
    %7 = iree_tensor_ext.compute_barrier.end %6 : tensor<4x4xf32> -> tensor<4x4xf32>
    %8 = hal.tensor.export %7 "output0" : tensor<4x4xf32> -> !hal.buffer_view
    util.return %8 : !hal.buffer_view
  }
}


// -----// IR Dump After FoldReshapesIntoTensorBarriersPass (iree-dispatch-creation-fold-reshapes-into-tensor-barriers) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = iree_tensor_ext.compute_barrier.start %0 : tensor<4x4xf32> -> tensor<4x4xf32>
  %2 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %3 = iree_tensor_ext.compute_barrier.start %2 : tensor<4x4xf32> -> tensor<4x4xf32>
  %4 = tensor.empty() : tensor<4x4xf32>
  %5 = linalg.matmul ins(%1, %3 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%5 : tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %9 = arith.maximumf %in, %cst : f32
    linalg.yield %9 : f32
  } -> tensor<4x4xf32>
  %7 = iree_tensor_ext.compute_barrier.end %6 : tensor<4x4xf32> -> tensor<4x4xf32>
  %8 = hal.tensor.export %7 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %8 : !hal.buffer_view
}

// -----// IR Dump After DemoteContractionInputsToBF16Pass (iree-global-opt-demote-contraction-inputs-to-bf16) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = iree_tensor_ext.compute_barrier.start %0 : tensor<4x4xf32> -> tensor<4x4xf32>
  %2 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %3 = iree_tensor_ext.compute_barrier.start %2 : tensor<4x4xf32> -> tensor<4x4xf32>
  %4 = tensor.empty() : tensor<4x4xf32>
  %5 = linalg.matmul ins(%1, %3 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%5 : tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %9 = arith.maximumf %in, %cst : f32
    linalg.yield %9 : f32
  } -> tensor<4x4xf32>
  %7 = iree_tensor_ext.compute_barrier.end %6 : tensor<4x4xf32> -> tensor<4x4xf32>
  %8 = hal.tensor.export %7 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %8 : !hal.buffer_view
}

// -----// IR Dump After CanonicalizePass (iree-flow-canonicalize) //----- //
util.func public @matmul(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @matmul(%input0: tensor<4x4xf32>, %input1: tensor<4x4xf32>) -> (%output0: tensor<4x4xf32>)"}} {
  %cst = arith.constant 0.000000e+00 : f32
  %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<4x4xf32>
  %1 = iree_tensor_ext.compute_barrier.start %0 : tensor<4x4xf32> -> tensor<4x4xf32>
  %2 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<4x4xf32>
  %3 = iree_tensor_ext.compute_barrier.start %2 : tensor<4x4xf32> -> tensor<4x4xf32>
  %4 = tensor.empty() : tensor<4x4xf32>
  %5 = linalg.matmul ins(%1, %3 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) -> tensor<4x4xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%5 : tensor<4x4xf32>) outs(%4 : tensor<4x4xf32>) {
  ^bb0(%in: f32, %out: f32):
    %9 = arith.maximumf %in, %cst : f32
    linalg.yield %9 : f32
  } -> tensor<4x4xf32>
  %7 = iree_tensor_ext.compute_barrier.end %6 : tensor<4x4xf32> -> tensor<4x4xf32>
  %8 = hal.tensor.export %7 "output0" : tensor<4x4xf32> -> !hal.buffer_view
  util.return %8 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
